src/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Пол</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Comment>Источник, откуда клиент узнал о Барбершопе</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиПолученияИнформацииОКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Контрагенты/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращаемое значение:
//  - Структура, Неопределено
Функция ПолучитьТипыКонтрагентов() Экспорт
    Возврат РаботаСМетаданными.ПолучитьЗначенияПеречисления(Тип("ПеречислениеСсылка.ТипыКонтрагентов"));
КонецФункции

// Устарела. Не используется в текущей реализации
// Параметры:
//  имяРеквизита - Строка
// Возвращаемое значение:
//  - Булево
Функция СодержитРеквизитаСИменем(Знач имяРеквизита) Экспорт
    Возврат Метаданные.Справочники.Контрагенты.Реквизиты.Найти(имяРеквизита) <> Неопределено;
КонецФункции

// Параметры:
//	ссылка - СправочникСсылка.Контрагенты, Произвольный
// Возвращаемое значение:
//	- ПеречислениеСсылка.ТипыКонтрагентов, Неопределено
Функция ПолучитьТипКонтрагента(Знач ссылка) Экспорт
    Если (НЕ ЗначениеЗаполнено(ссылка))
        ИЛИ ТипЗнч(ссылка) <> Тип("СправочникСсылка.Контрагенты") Тогда
        Возврат Неопределено;
    КонецЕсли;

    запросКонтрагента = Новый Запрос;
    запросКонтрагента.УстановитьПараметр("Ссылка", ссылка);

    запросКонтрагента.Текст =
        "ВЫБРАТЬ
        |	Контрагенты.ТипКонтрагента КАК ТипКонтрагента
        |ИЗ
        |	Справочник.Контрагенты КАК Контрагенты
        |ГДЕ
        |	Контрагенты.Ссылка = &Ссылка
        |";

    выборка = запросКонтрагента.Выполнить().Выбрать();
    Если выборка.Следующий() Тогда
        Возврат выборка.ТипКонтрагента;
    КонецЕсли;

    Возврат Неопределено;
КонецФункции

// Параметры:
//	ссылка - СправочникСсылка.Контрагенты, Произвольный
// Возвращаемое значение:
//	- Булево
Функция ЭтотКонтрагентКлиент(Знач ссылка) Экспорт
    Возврат ПолучитьТипКонтрагента(ссылка) = Перечисления.ТипыКонтрагентов.Клиент;
КонецФункции

// Параметры:
//	ссылка - СправочникСсылка.Контрагенты, Произвольный
// Возвращаемое значение:
//	- Булево
Функция ЭтотКонтрагентПоставщик(Знач ссылка) Экспорт
    Возврат ПолучитьТипКонтрагента(ссылка) = Перечисления.ТипыКонтрагентов.Поставщик;
КонецФункции

#КонецОбласти
